Repository: bengtapig/VectorC2
Catalog: vectorc2/command/locale/*/LC_MESSAGES/djangojs.po
Languages: pl

source: Maximum execution iterations exceeded.
pl: Przekroczony maksymalną ilość powtórzeń

source: Program error: %(error)s
pl: Błąd programu: %(error)s

source: Running Vector with serial number = %(serial)s
pl: Uruchamianie Vectora z numerem seryjnym = %(serial)s

source: Running Vector
pl: Uruchamianie Vectora

source: Should have waited $(seconds)s
pl: Powinniśmy czekać $(seconds)s

source: Vector drives off charger
pl: Vector zjeżdża ze stacji bazowej

source: Vector drives on charger
pl: Vector wjeżdza na stację bazową

source: Vector drives %(distance)s at %(speed)s. (Plays animation: %(should_play_anim)s. Retries: %(num_retries)s)
pl: Vector przejedzie %(distance)s przy prędkości %(speed)s. (Odegra animację: %(should_play_anim)s. Ilość prób: %(num_retries)s)

source: Vector rotates %(angle)s at speed %(speed)s with acceleration %(accel)s, at tolerance %(angle_tolerance)s. Angle is absolute: %(is_absolute)s. Retries: %(num_retries)s
pl: Vector obróci się o kąt %(angle)s przy prędkości %(speed)s z przyspieszeniem %(accel)s, z dokładnością %(angle_tolerance)s. Podany kąt jest bezwzględny: %(is_absolute)s. Ilość prób: %(num_retries)s

source: Vector eyes color set to %(color)s
pl: Kolor oczu Vectora ustawiony na %(color)s

source: Vector eyes color set with hue=%(hue)s and saturation=%(saturation)s
pl: Kolor oczu Vectora ustawiony dla koloru %(hue)s i nasycenia %(saturation)s

source: Vector will dock with cube
pl: Vector uda się do stacji bazowej z kostką

source: Vector will set head angle to %(angle)s
pl: Vector ustawi głowę pod kątem %(angle)s

source: Vector will lift to %(height)s
pl: Vector podniesie ramiona do wysokości %(height)s
